# 2. Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# in
# 4

# out
# [2, 5, 8, 10]
# [20, 40]

# in
# 5

# out
# [2, 2, 4, 8, 8]
# [16, 16, 4]

# =====================================================================

# Решение:

num = int(input("Введите количество элементов, которое будет в списке: "))


def GetListRandomElements(lengthList, minEl, maxEL):
    import random
    newList = []

    for i in range(lengthList):
        e = random.randint(minEl, maxEL)
        newList.append(e)

    return newList

# =====================================================================