# ** 5. Реализуйте алгоритм перемешивания списка.
# Без функции shuffle из модуля random.
# 10
# -> [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# -> [0, 7, 6, 3, 4, 2, 9, 5, 1, 8]

# ===========================================================

# Решение:

num = int(input("Введите число, которое будет максимальным в списке, который вы хотите перетосовать\nЧисло: "))

def СreatingNewList(startNum):

    newList = []
    endNum = startNum + 1

    for i in range(endNum):

        newList.append(i)

    return newList

print(СreatingNewList(num))

# ===========================================================
