# 5. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве. https://ru.onlinemschool.com/math/library/analytic_geometry/point_point_length/
# in
# - 3
# - 6
# - 2
# - 1

# out
# 5.099

#===================================================================================

#Решение:

import math

xA = float(input("Значение координат по оси x для точки А: "))
yA = float(input("Значение координат по оси y для точки А: "))
xB = float(input("Значение координат по оси x для точки B: "))
yB = float(input("Значение координат по оси y для точки B: "))

res = math.sqrt((xB - xA) ** 2 + (yB - yA) ** 2)

print(round(res, 3))

#===================================================================================
