# 2. Для чисел в пределах от 20 до N найти числа, кратные 20 или 21. Use comprehension.
# in
# 100

# out
# [20, 21, 40, 42, 60, 63, 80, 84, 100]

# in
# 424

# out
# [20, 21, 40, 42, 60, 63, 80, 84, 100, 105, 120, 126, 140, 147, 160, 168, 180, 189, 200, 210, 220, 231, 240, 252, 260, 273, 280, 294, 300, 315, 320, 336, 340, 357, 360, 378, 380, 399, 400, 420]

# =============================================================================

# Решение:

num_1, num_2 = 20, 21
min_n = 20
max_n = int(input("Введите диапозон от {} до N, \
    чтобы найти числа, кратные {} или {}: ".format(min_n, num_1, num_2)))


l_n = [i for i in range(min_n, max_n + 1) if i % num_1 == 0 or i % num_2 == 0]

print(l_n)

# =============================================================================
